#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.certificate.data.azurerm_key_vault.key_vault: Reading...
module.vnet.data.azurerm_virtual_network.vnet_data: Reading...
module.vnet.data.azurerm_virtual_network.vnet_data: Read complete after 0s [id=/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/virtualNetworks/vnet-quotesapp-prod]
module.network.azurerm_subnet.web: Refreshing state... [id=/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/virtualNetworks/vnet-quotesapp-prod/subnets/web-subnet]
module.network.azurerm_subnet.app: Refreshing state... [id=/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/virtualNetworks/vnet-quotesapp-prod/subnets/app-subnet]
module.network.azurerm_subnet.mgmt: Refreshing state... [id=/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/virtualNetworks/vnet-quotesapp-prod/subnets/mgmt-subnet]
module.network.azurerm_subnet.db: Refreshing state... [id=/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/virtualNetworks/vnet-quotesapp-prod/subnets/db-subnet]
module.network.azurerm_nat_gateway.nat: Refreshing state... [id=/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/natGateways/quotesapp-nat]
module.network.azurerm_public_ip_prefix.nat: Refreshing state... [id=/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/publicIPPrefixes/quotesapp-pipprefix]
module.network.azurerm_network_security_group.web_nsg: Refreshing state... [id=/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/networkSecurityGroups/web-nsg]
module.network.azurerm_network_interface.mgmt_vm_nic: Refreshing state... [id=/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/networkInterfaces/nic-mgmt-vm]
module.network.time_sleep.wait_nat: Refreshing state... [id=2025-09-16T06:41:58Z]
module.network.azurerm_nat_gateway_public_ip_prefix_association.nat: Refreshing state... [id=/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/natGateways/quotesapp-nat|/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/publicIPPrefixes/quotesapp-pipprefix]
module.network.azurerm_subnet_network_security_group_association.web_association: Refreshing state... [id=/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/virtualNetworks/vnet-quotesapp-prod/subnets/web-subnet]
module.certificate.data.azurerm_key_vault.key_vault: Read complete after 0s [id=/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/terraform-backend-rg/providers/Microsoft.KeyVault/vaults/quotesappprodkv]
module.certificate.azurerm_key_vault_certificate.ssl_cert: Refreshing state... [id=https://quotesappprodkv.vault.azure.net/certificates/cert-appgateway-quotesapp/96649ae2080b4f96a5e61640dec7569c]
module.network.azurerm_subnet_nat_gateway_association.app_nat: Refreshing state... [id=/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/virtualNetworks/vnet-quotesapp-prod/subnets/app-subnet]
module.acr.azurerm_private_dns_zone.acr_dns: Refreshing state... [id=/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/privateDnsZones/privatelink.azurecr.io]
module.acr.azurerm_container_registry.acr: Refreshing state... [id=/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.ContainerRegistry/registries/quotesappacrprod]
module.sql.azurerm_private_dns_zone.sql_dns: Refreshing state... [id=/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/privateDnsZones/privatelink.database.windows.net]
module.sql.azurerm_mssql_server.sql_server: Refreshing state... [id=/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Sql/servers/sqlserver-quotesapp-prod]
module.sql.azurerm_private_dns_zone_virtual_network_link.sql_dns_link: Refreshing state... [id=/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/privateDnsZones/privatelink.database.windows.net/virtualNetworkLinks/sql-dns-link]
module.acr.azurerm_private_dns_zone_virtual_network_link.acr_dns_link: Refreshing state... [id=/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/privateDnsZones/privatelink.azurecr.io/virtualNetworkLinks/acr-dns-link-quotesapp]
module.acr.azurerm_private_endpoint.acr_pe: Refreshing state... [id=/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/privateEndpoints/acr-pe-quotesapp]
module.sql.azurerm_private_endpoint.sql_pe: Refreshing state... [id=/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/privateEndpoints/sql-private-endpoint]
module.sql.azurerm_mssql_database.sql_database: Refreshing state... [id=/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Sql/servers/sqlserver-quotesapp-prod/databases/sqldb-quotesapp-prod]
module.app_service.azurerm_private_dns_zone.appservice_dns: Refreshing state... [id=/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/privateDnsZones/privatelink.azurewebsites.net]
module.app_service.azurerm_private_dns_zone_virtual_network_link.appservice_dns_link: Refreshing state... [id=/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/privateDnsZones/privatelink.azurewebsites.net/virtualNetworkLinks/appservice-dns-link]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.acr.azurerm_container_registry.acr must be replaced
-/+ resource "azurerm_container_registry" "acr" {
      + admin_password                = (sensitive value)
      + admin_username                = (known after apply)
      - anonymous_pull_enabled        = false -> null
      - data_endpoint_enabled         = false -> null
      ~ data_endpoint_host_names      = [
          - "quotesappacrprod.eastus2.data.azurecr.io",
        ] -> (known after apply)
      ~ encryption                    = [] -> (known after apply)
      ~ id                            = "/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.ContainerRegistry/registries/quotesappacrprod" -> (known after apply)
      ~ location                      = "eastus2" -> "centralus" # forces replacement
      ~ login_server                  = "quotesappacrprod.azurecr.io" -> (known after apply)
        name                          = "quotesappacrprod"
      ~ network_rule_set              = [
          - {
              - default_action = "Allow"
              - ip_rule        = []
            },
        ] -> (known after apply)
      - quarantine_policy_enabled     = false -> null
      - retention_policy_in_days      = 0 -> null
        tags                          = {
            "Environment" = "Production"
            "Owner"       = "Rahul"
            "Project"     = "QuotesApp"
        }
        # (8 unchanged attributes hidden)
    }

  # module.acr.azurerm_private_endpoint.acr_pe must be replaced
-/+ resource "azurerm_private_endpoint" "acr_pe" {
      ~ custom_dns_configs            = [] -> (known after apply)
      ~ id                            = "/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/privateEndpoints/acr-pe-quotesapp" -> (known after apply)
      ~ location                      = "eastus2" -> "centralus" # forces replacement
        name                          = "acr-pe-quotesapp"
      ~ network_interface             = [
          - {
              - id   = "/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/networkInterfaces/acr-pe-quotesapp.nic.9d70d098-d3b2-4ffb-97f5-4c3197a44630"
              - name = "acr-pe-quotesapp.nic.9d70d098-d3b2-4ffb-97f5-4c3197a44630"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs      = [
          - {
              - id                  = "/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/privateEndpoints/acr-pe-quotesapp/privateDnsZoneGroups/acr-dns-zone-group-quotesapp/privateDnsZoneConfigs/privatelink.azurecr.io"
              - name                = "privatelink.azurecr.io"
              - private_dns_zone_id = "/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/privateDnsZones/privatelink.azurecr.io"
              - record_sets         = [
                  - {
                      - fqdn         = "quotesappacrprod.eastus2.data.privatelink.azurecr.io"
                      - ip_addresses = [
                          - "10.0.3.4",
                        ]
                      - name         = "quotesappacrprod.eastus2.data"
                      - ttl          = 10
                      - type         = "A"
                    },
                  - {
                      - fqdn         = "quotesappacrprod.privatelink.azurecr.io"
                      - ip_addresses = [
                          - "10.0.3.5",
                        ]
                      - name         = "quotesappacrprod"
                      - ttl          = 10
                      - type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
        tags                          = {
            "Environment" = "Production"
            "Owner"       = "Rahul"
            "Project"     = "QuotesApp"
        }
        # (3 unchanged attributes hidden)

      ~ private_dns_zone_group {
          ~ id                   = "/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/privateEndpoints/acr-pe-quotesapp/privateDnsZoneGroups/acr-dns-zone-group-quotesapp" -> (known after apply)
            name                 = "acr-dns-zone-group-quotesapp"
            # (1 unchanged attribute hidden)
        }

      ~ private_service_connection {
            name                              = "acr-privateserviceconnection-quotesapp"
          ~ private_connection_resource_id    = "/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.ContainerRegistry/registries/quotesappacrprod" -> (known after apply) # forces replacement
          ~ private_ip_address                = "10.0.3.4" -> (known after apply)
            # (4 unchanged attributes hidden)
        }
    }

  # module.app_service.data.azurerm_key_vault.key_vault will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault" "key_vault" {
      + access_policy                   = (known after apply)
      + enable_rbac_authorization       = (known after apply)
      + enabled_for_deployment          = (known after apply)
      + enabled_for_disk_encryption     = (known after apply)
      + enabled_for_template_deployment = (known after apply)
      + id                              = (known after apply)
      + location                        = (known after apply)
      + name                            = (sensitive value)
      + network_acls                    = (known after apply)
      + public_network_access_enabled   = (known after apply)
      + purge_protection_enabled        = (known after apply)
      + rbac_authorization_enabled      = (known after apply)
      + resource_group_name             = (sensitive value)
      + sku_name                        = (known after apply)
      + tags                            = (known after apply)
      + tenant_id                       = (known after apply)
      + vault_uri                       = (known after apply)
    }

  # module.app_service.data.azurerm_key_vault_secret.db_user_login will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_key_vault_secret" "db_user_login" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "SQL-QUOTES-APP-PROD-DB-USER-LOGIN"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # module.app_service.data.azurerm_key_vault_secret.db_user_password will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_key_vault_secret" "db_user_password" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "SQL-QUOTES-APP-PROD-DB-USER-PASSWORD"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # module.app_service.azurerm_linux_web_app.webapp will be created
  + resource "azurerm_linux_web_app" "webapp" {
      + app_settings                                   = (known after apply)
      + client_affinity_enabled                        = false
      + client_certificate_enabled                     = false
      + client_certificate_mode                        = "Required"
      + custom_domain_verification_id                  = (sensitive value)
      + default_hostname                               = (known after apply)
      + enabled                                        = true
      + ftp_publish_basic_authentication_enabled       = true
      + hosting_environment_id                         = (known after apply)
      + https_only                                     = true
      + id                                             = (known after apply)
      + key_vault_reference_identity_id                = (known after apply)
      + kind                                           = (known after apply)
      + location                                       = "centralus"
      + name                                           = "webapp-quotesapp-prod"
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = false
      + resource_group_name                            = "rg-quotesapp-prod"
      + service_plan_id                                = (known after apply)
      + site_credential                                = (sensitive value)
      + tags                                           = {
          + "Environment" = "Production"
          + "Owner"       = "Rahul"
          + "Project"     = "QuotesApp"
        }
      + virtual_network_backup_restore_enabled         = false
      + virtual_network_subnet_id                      = "/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/virtualNetworks/vnet-quotesapp-prod/subnets/app-subnet"
      + vnet_image_pull_enabled                        = true
      + webdeploy_publish_basic_authentication_enabled = true
      + zip_deploy_file                                = (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + site_config {
          + always_on                               = true
          + container_registry_use_managed_identity = true
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + ftps_state                              = "Disabled"
          + health_check_eviction_time_in_min       = 2
          + health_check_path                       = "/health"
          + http2_enabled                           = true
          + ip_restriction_default_action           = "Allow"
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + local_mysql_enabled                     = false
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_ip_restriction_default_action       = "Allow"
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = true
          + vnet_route_all_enabled                  = true
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)

          + application_stack {
              + docker_image_name   = "{var.docker_image_name}}:{var.docker_image_tag}"
              + docker_registry_url = (known after apply)
            }
        }
    }

  # module.app_service.azurerm_private_endpoint.app_pe will be created
  + resource "azurerm_private_endpoint" "app_pe" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "centralus"
      + name                     = "app-private-endpoint"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "rg-quotesapp-prod"
      + subnet_id                = "/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/virtualNetworks/vnet-quotesapp-prod/subnets/db-subnet"
      + tags                     = {
          + "Environment" = "Production"
          + "Owner"       = "Rahul"
          + "Project"     = "QuotesApp"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "appservice-dns-zone-group"
          + private_dns_zone_ids = [
              + "/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/privateDnsZones/privatelink.azurewebsites.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "app-privateserviceconnection"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "sites",
            ]
        }
    }

  # module.app_service.azurerm_role_assignment.acr_pull will be created
  + resource "azurerm_role_assignment" "acr_pull" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPull"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.app_service.azurerm_service_plan.service_plan will be created
  + resource "azurerm_service_plan" "service_plan" {
      + id                              = (known after apply)
      + kind                            = (known after apply)
      + location                        = "centralus"
      + maximum_elastic_worker_count    = (known after apply)
      + name                            = "service-plan-quotesapp-prod"
      + os_type                         = "Linux"
      + per_site_scaling_enabled        = false
      + premium_plan_auto_scale_enabled = false
      + reserved                        = (known after apply)
      + resource_group_name             = "rg-quotesapp-prod"
      + sku_name                        = "B1"
      + tags                            = {
          + "Environment" = "Production"
          + "Owner"       = "Rahul"
          + "Project"     = "QuotesApp"
        }
      + worker_count                    = (known after apply)
    }

  # module.application_gateway.data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.application_gateway.data.azurerm_key_vault.key_vault will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault" "key_vault" {
      + access_policy                   = (known after apply)
      + enable_rbac_authorization       = (known after apply)
      + enabled_for_deployment          = (known after apply)
      + enabled_for_disk_encryption     = (known after apply)
      + enabled_for_template_deployment = (known after apply)
      + id                              = (known after apply)
      + location                        = (known after apply)
      + name                            = "quotesappprodkv"
      + network_acls                    = (known after apply)
      + public_network_access_enabled   = (known after apply)
      + purge_protection_enabled        = (known after apply)
      + rbac_authorization_enabled      = (known after apply)
      + resource_group_name             = "terraform-backend-rg"
      + sku_name                        = (known after apply)
      + tags                            = (known after apply)
      + tenant_id                       = (known after apply)
      + vault_uri                       = (known after apply)
    }

  # module.application_gateway.azurerm_application_gateway.application_gateway will be created
  + resource "azurerm_application_gateway" "application_gateway" {
      + enable_http2                = true
      + id                          = (known after apply)
      + location                    = "centralus"
      + name                        = "appgateway-quotesapp"
      + private_endpoint_connection = (known after apply)
      + resource_group_name         = "rg-quotesapp-prod"
      + tags                        = {
          + "Environment" = "Production"
          + "Owner"       = "Rahul"
          + "Project"     = "QuotesApp"
        }

      + backend_address_pool {
          + fqdns        = [
              + "webapp-quotesapp-prod.privatelink.azurewebsites.net",
            ]
          + id           = (known after apply)
          + ip_addresses = []
          + name         = "vnet-quotesapp-prod-beap"
        }

      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + host_name                           = (known after apply)
          + id                                  = (known after apply)
          + name                                = "vnet-quotesapp-prod-be-htst"
          + pick_host_name_from_backend_address = false
          + port                                = 443
          + probe_id                            = (known after apply)
          + probe_name                          = "vnet-quotesapp-prod-probe"
          + protocol                            = "Https"
          + request_timeout                     = 60
          + trusted_root_certificate_names      = []
            # (2 unchanged attributes hidden)
        }

      + frontend_ip_configuration {
          + id                            = (known after apply)
          + name                          = "vnet-quotesapp-prod-feip"
          + private_ip_address            = (known after apply)
          + private_ip_address_allocation = "Dynamic"
          + private_link_configuration_id = (known after apply)
          + public_ip_address_id          = (known after apply)
        }

      + frontend_port {
          + id   = (known after apply)
          + name = "vnet-quotesapp-prod-feport"
          + port = 443
        }

      + gateway_ip_configuration {
          + id        = (known after apply)
          + name      = "ip-configuration-appgateway-quotesapp"
          + subnet_id = "/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/virtualNetworks/vnet-quotesapp-prod/subnets/web-subnet"
        }

      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "vnet-quotesapp-prod-feip"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "vnet-quotesapp-prod-feport"
          + host_names                     = []
          + id                             = (known after apply)
          + name                           = "vnet-quotesapp-prod-httplstn"
          + protocol                       = "Https"
          + ssl_certificate_id             = (known after apply)
          + ssl_certificate_name           = "appgateway-cert-quotesapp"
          + ssl_profile_id                 = (known after apply)
            # (3 unchanged attributes hidden)
        }

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "UserAssigned"
        }

      + probe {
          + host                                      = (known after apply)
          + id                                        = (known after apply)
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "vnet-quotesapp-prod-probe"
          + path                                      = "/health"
          + pick_host_name_from_backend_http_settings = false
          + protocol                                  = "Https"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3

          + match {
              + status_code = [
                  + "200-399",
                ]
                # (1 unchanged attribute hidden)
            }
        }

      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "vnet-quotesapp-prod-beap"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "vnet-quotesapp-prod-be-htst"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "vnet-quotesapp-prod-httplstn"
          + id                          = (known after apply)
          + name                        = "vnet-quotesapp-prod-rqrt"
          + priority                    = 9
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (3 unchanged attributes hidden)
        }

      + sku {
          + capacity = 1
          + name     = "Basic"
          + tier     = "Basic"
        }

      + ssl_certificate {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + ssl_policy (known after apply)
    }

  # module.application_gateway.azurerm_public_ip.pip will be created
  + resource "azurerm_public_ip" "pip" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "centralus"
      + name                    = "pip-appgateway-quotesapp"
      + resource_group_name     = "rg-quotesapp-prod"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
    }

  # module.application_gateway.azurerm_role_assignment.appgw_kv_secret_access will be created
  + resource "azurerm_role_assignment" "appgw_kv_secret_access" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.application_gateway.azurerm_user_assigned_identity.appgw_identity will be created
  + resource "azurerm_user_assigned_identity" "appgw_identity" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "centralus"
      + name                = "appgw_identity_quotesapp"
      + principal_id        = (known after apply)
      + resource_group_name = "rg-quotesapp-prod"
      + tenant_id           = (known after apply)
    }

  # module.certificate.azurerm_key_vault_certificate.ssl_cert will be updated in-place
  ~ resource "azurerm_key_vault_certificate" "ssl_cert" {
        id                              = "https://quotesappprodkv.vault.azure.net/certificates/cert-appgateway-quotesapp/96649ae2080b4f96a5e61640dec7569c"
        name                            = "cert-appgateway-quotesapp"
        tags                            = {
            "Environment" = "Production"
            "Owner"       = "Rahul"
            "Project"     = "QuotesApp"
        }
        # (11 unchanged attributes hidden)

      ~ certificate_policy {
          ~ x509_certificate_properties {
              ~ subject            = "CN=app.quotesapp.com, O=Rahul Org" -> "CN=app.quotesapp.com, O=Our Org"
                # (3 unchanged attributes hidden)

                # (1 unchanged block hidden)
            }

            # (4 unchanged blocks hidden)
        }
    }

  # module.network.azurerm_linux_virtual_machine.mgmt_vm will be created
  + resource "azurerm_linux_virtual_machine" "mgmt_vm" {
      + admin_password                                         = (sensitive value)
      + admin_username                                         = "azureuser"
      + allow_extension_operations                             = (known after apply)
      + bypass_platform_safety_checks_on_user_schedule_enabled = false
      + computer_name                                          = (known after apply)
      + disable_password_authentication                        = false
      + disk_controller_type                                   = (known after apply)
      + extensions_time_budget                                 = "PT1H30M"
      + id                                                     = (known after apply)
      + location                                               = "centralus"
      + max_bid_price                                          = -1
      + name                                                   = "vm-mgmt"
      + network_interface_ids                                  = (known after apply)
      + os_managed_disk_id                                     = (known after apply)
      + patch_assessment_mode                                  = (known after apply)
      + patch_mode                                             = (known after apply)
      + platform_fault_domain                                  = -1
      + priority                                               = "Regular"
      + private_ip_address                                     = (known after apply)
      + private_ip_addresses                                   = (known after apply)
      + provision_vm_agent                                     = (known after apply)
      + public_ip_address                                      = (known after apply)
      + public_ip_addresses                                    = (known after apply)
      + resource_group_name                                    = "rg-quotesapp-prod"
      + size                                                   = "Standard_B2s"
      + tags                                                   = {
          + "Environment" = "Production"
          + "Owner"       = "Rahul"
          + "Project"     = "QuotesApp"
        }
      + virtual_machine_id                                     = (known after apply)
      + vm_agent_platform_updates_enabled                      = (known after apply)

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = (known after apply)
          + id                        = (known after apply)
          + name                      = (known after apply)
          + storage_account_type      = "Standard_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "0001-com-ubuntu-server-jammy"
          + publisher = "Canonical"
          + sku       = "22_04-lts"
          + version   = "latest"
        }

      + termination_notification (known after apply)
    }

  # module.network.azurerm_nat_gateway.nat must be replaced
-/+ resource "azurerm_nat_gateway" "nat" {
      ~ id                      = "/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/natGateways/quotesapp-nat" -> (known after apply)
      ~ location                = "eastus2" -> "centralus" # forces replacement
        name                    = "quotesapp-nat"
      ~ resource_guid           = "52206f29-6a53-4cd0-8d0e-b77dd7aea7fb" -> (known after apply)
        tags                    = {
            "Environment" = "Production"
            "Owner"       = "Rahul"
            "Project"     = "QuotesApp"
        }
      - zones                   = [] -> null
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.network.azurerm_nat_gateway_public_ip_prefix_association.nat must be replaced
-/+ resource "azurerm_nat_gateway_public_ip_prefix_association" "nat" {
      ~ id                  = "/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/natGateways/quotesapp-nat|/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/publicIPPrefixes/quotesapp-pipprefix" -> (known after apply)
      ~ nat_gateway_id      = "/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/natGateways/quotesapp-nat" -> (known after apply) # forces replacement
      ~ public_ip_prefix_id = "/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/publicIPPrefixes/quotesapp-pipprefix" -> (known after apply) # forces replacement
    }

  # module.network.azurerm_network_interface.mgmt_vm_nic must be replaced
-/+ resource "azurerm_network_interface" "mgmt_vm_nic" {
      ~ applied_dns_servers            = [] -> (known after apply)
      - dns_servers                    = [] -> null
      ~ id                             = "/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/networkInterfaces/nic-mgmt-vm" -> (known after apply)
      ~ internal_domain_name_suffix    = "vgxcqqr1jbrexhqhrpsidcjlhh.cx.internal.cloudapp.net" -> (known after apply)
      ~ location                       = "eastus2" -> "centralus" # forces replacement
      + mac_address                    = (known after apply)
        name                           = "nic-mgmt-vm"
      ~ private_ip_address             = "10.0.11.4" -> (known after apply)
      ~ private_ip_addresses           = [
          - "10.0.11.4",
        ] -> (known after apply)
      - tags                           = {} -> null
      + virtual_machine_id             = (known after apply)
        # (7 unchanged attributes hidden)

      ~ ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
            name                                               = "internal"
          ~ primary                                            = true -> (known after apply)
          ~ private_ip_address                                 = "10.0.11.4" -> (known after apply)
            # (4 unchanged attributes hidden)
        }
    }

  # module.network.azurerm_network_security_group.web_nsg must be replaced
-/+ resource "azurerm_network_security_group" "web_nsg" {
      ~ id                  = "/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/networkSecurityGroups/web-nsg" -> (known after apply)
      ~ location            = "eastus2" -> "centralus" # forces replacement
        name                = "web-nsg"
        tags                = {
            "Environment" = "Production"
            "Owner"       = "Rahul"
            "Project"     = "QuotesApp"
        }
        # (2 unchanged attributes hidden)
    }

  # module.network.azurerm_public_ip_prefix.nat must be replaced
-/+ resource "azurerm_public_ip_prefix" "nat" {
      ~ id                  = "/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/publicIPPrefixes/quotesapp-pipprefix" -> (known after apply)
      ~ ip_prefix           = "20.186.81.26/31" -> (known after apply)
      ~ location            = "eastus2" -> "centralus" # forces replacement
        name                = "quotesapp-pipprefix"
        tags                = {
            "Environment" = "Production"
            "Owner"       = "Rahul"
            "Project"     = "QuotesApp"
        }
        # (7 unchanged attributes hidden)
    }

  # module.network.azurerm_subnet.app will be updated in-place
  ~ resource "azurerm_subnet" "app" {
        id                                            = "/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/virtualNetworks/vnet-quotesapp-prod/subnets/app-subnet"
        name                                          = "app-subnet"
        # (8 unchanged attributes hidden)

      ~ delegation {
            name = "appservice-delegation"

          ~ service_delegation {
              ~ actions = [
                  - "Microsoft.Network/virtualNetworks/subnets/action",
                ]
                name    = "Microsoft.Web/serverFarms"
            }
        }
    }

  # module.network.azurerm_subnet_nat_gateway_association.app_nat must be replaced
-/+ resource "azurerm_subnet_nat_gateway_association" "app_nat" {
      ~ id             = "/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/virtualNetworks/vnet-quotesapp-prod/subnets/app-subnet" -> (known after apply)
      ~ nat_gateway_id = "/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/natGateways/quotesapp-nat" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.network.azurerm_subnet_network_security_group_association.web_association must be replaced
-/+ resource "azurerm_subnet_network_security_group_association" "web_association" {
      ~ id                        = "/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/virtualNetworks/vnet-quotesapp-prod/subnets/web-subnet" -> (known after apply)
      ~ network_security_group_id = "/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/networkSecurityGroups/web-nsg" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.sql.data.azurerm_key_vault.key_vault will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault" "key_vault" {
      + access_policy                   = (known after apply)
      + enable_rbac_authorization       = (known after apply)
      + enabled_for_deployment          = (known after apply)
      + enabled_for_disk_encryption     = (known after apply)
      + enabled_for_template_deployment = (known after apply)
      + id                              = (known after apply)
      + location                        = (known after apply)
      + name                            = (sensitive value)
      + network_acls                    = (known after apply)
      + public_network_access_enabled   = (known after apply)
      + purge_protection_enabled        = (known after apply)
      + rbac_authorization_enabled      = (known after apply)
      + resource_group_name             = (sensitive value)
      + sku_name                        = (known after apply)
      + tags                            = (known after apply)
      + tenant_id                       = (known after apply)
      + vault_uri                       = (known after apply)
    }

  # module.sql.data.azurerm_key_vault_secret.sql_admin_login will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_key_vault_secret" "sql_admin_login" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "SQL-QUOTES-APP-PROD-ADMIN-LOGIN"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # module.sql.data.azurerm_key_vault_secret.sql_admin_password will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_key_vault_secret" "sql_admin_password" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "SQL-QUOTES-APP-PROD-ADMIN-PASSWORD"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # module.sql.azurerm_mssql_database.sql_database must be replaced
-/+ resource "azurerm_mssql_database" "sql_database" {
      ~ auto_pause_delay_in_minutes                                = 0 -> (known after apply)
      + creation_source_database_id                                = (known after apply)
      ~ id                                                         = "/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Sql/servers/sqlserver-quotesapp-prod/databases/sqldb-quotesapp-prod" -> (known after apply)
      ~ ledger_enabled                                             = false -> (known after apply)
      + license_type                                               = (known after apply)
      ~ maintenance_configuration_name                             = "SQL_Default" -> (known after apply)
      ~ min_capacity                                               = 0 -> (known after apply)
        name                                                       = "sqldb-quotesapp-prod"
      ~ read_replica_count                                         = 0 -> (known after apply)
      ~ read_scale                                                 = false -> (known after apply)
      + restore_point_in_time                                      = (known after apply)
      + sample_name                                                = (known after apply)
      + secondary_type                                             = (known after apply)
      ~ server_id                                                  = "/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Sql/servers/sqlserver-quotesapp-prod" -> (known after apply) # forces replacement
        tags                                                       = {
            "Environment" = "Production"
            "Owner"       = "Rahul"
            "Project"     = "QuotesApp"
        }
        # (12 unchanged attributes hidden)

      ~ long_term_retention_policy (known after apply)
      - long_term_retention_policy {
          - immutable_backups_enabled = false -> null
          - monthly_retention         = "PT0S" -> null
          - week_of_year              = 1 -> null
          - weekly_retention          = "PT0S" -> null
          - yearly_retention          = "PT0S" -> null
        }

      ~ short_term_retention_policy (known after apply)
      - short_term_retention_policy {
          - backup_interval_in_hours = 24 -> null
          - retention_days           = 7 -> null
        }

      ~ threat_detection_policy (known after apply)
      - threat_detection_policy {
          - disabled_alerts            = [] -> null
          - email_account_admins       = "Disabled" -> null
          - email_addresses            = [] -> null
          - retention_days             = 0 -> null
          - state                      = "Disabled" -> null
            # (2 unchanged attributes hidden)
        }
    }

  # module.sql.azurerm_mssql_server.sql_server must be replaced
-/+ resource "azurerm_mssql_server" "sql_server" {
      ~ administrator_login                          = (sensitive value) # forces replacement
      ~ administrator_login_password                 = (sensitive value)
      - administrator_login_password_wo_version      = 0 -> null
      ~ fully_qualified_domain_name                  = "sqlserver-quotesapp-prod.database.windows.net" -> (known after apply)
      ~ id                                           = "/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Sql/servers/sqlserver-quotesapp-prod" -> (known after apply)
      ~ location                                     = "eastus2" -> "centralus" # forces replacement
        name                                         = "sqlserver-quotesapp-prod"
      + primary_user_assigned_identity_id            = (known after apply)
      ~ restorable_dropped_database_ids              = [] -> (known after apply)
        tags                                         = {
            "Environment" = "Production"
            "Owner"       = "Rahul"
            "Project"     = "QuotesApp"
        }
        # (9 unchanged attributes hidden)
    }

  # module.sql.azurerm_private_endpoint.sql_pe must be replaced
-/+ resource "azurerm_private_endpoint" "sql_pe" {
      ~ custom_dns_configs            = [] -> (known after apply)
      ~ id                            = "/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/privateEndpoints/sql-private-endpoint" -> (known after apply)
      ~ location                      = "eastus2" -> "centralus" # forces replacement
        name                          = "sql-private-endpoint"
      ~ network_interface             = [
          - {
              - id   = "/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/networkInterfaces/sql-private-endpoint.nic.c7c85d20-0d3f-4beb-9a62-7c54810d82f7"
              - name = "sql-private-endpoint.nic.c7c85d20-0d3f-4beb-9a62-7c54810d82f7"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs      = [
          - {
              - id                  = "/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/privateEndpoints/sql-private-endpoint/privateDnsZoneGroups/sql-dns-zone-group/privateDnsZoneConfigs/privatelink.database.windows.net"
              - name                = "privatelink.database.windows.net"
              - private_dns_zone_id = "/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/privateDnsZones/privatelink.database.windows.net"
              - record_sets         = [
                  - {
                      - fqdn         = "sqlserver-quotesapp-prod.privatelink.database.windows.net"
                      - ip_addresses = [
                          - "10.0.3.6",
                        ]
                      - name         = "sqlserver-quotesapp-prod"
                      - ttl          = 10
                      - type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
        tags                          = {
            "Environment" = "Production"
            "Owner"       = "Rahul"
            "Project"     = "QuotesApp"
        }
        # (3 unchanged attributes hidden)

      ~ private_dns_zone_group {
          ~ id                   = "/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Network/privateEndpoints/sql-private-endpoint/privateDnsZoneGroups/sql-dns-zone-group" -> (known after apply)
            name                 = "sql-dns-zone-group"
            # (1 unchanged attribute hidden)
        }

      ~ private_service_connection {
            name                              = "sql-privateserviceconnection"
          ~ private_connection_resource_id    = "/subscriptions/ca7124db-9f7c-4459-a6a5-c74b41ca6149/resourceGroups/rg-quotesapp-prod/providers/Microsoft.Sql/servers/sqlserver-quotesapp-prod" -> (known after apply) # forces replacement
          ~ private_ip_address                = "10.0.3.6" -> (known after apply)
            # (4 unchanged attributes hidden)
        }
    }

Plan: 21 to add, 2 to change, 12 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @nagarajurahul, Action: `pull_request`*